---
kind: type
id: T:Autodesk.Revit.DB.Structure.MemberForces
source: html/aecdc0e5-e656-64cc-c1be-73b34a5f5a15.htm
---
# Autodesk.Revit.DB.Structure.MemberForces

An object that represents a member forces on analytical element.

## Syntax (C#)
```csharp
public class MemberForces : IDisposable
```